In [1]:
# built-in dataframes
state.x77

               Population Income Illiteracy Life Exp Murder HS Grad Frost
Alabama         3615      3624   2.1        69.05    15.1   41.3     20
Alaska           365      6315   1.5        69.31    11.3   66.7    152
Arizona         2212      4530   1.8        70.55     7.8   58.1     15
Arkansas        2110      3378   1.9        70.66    10.1   39.9     65
California     21198      5114   1.1        71.71    10.3   62.6     20
Colorado        2541      4884   0.7        72.06     6.8   63.9    166
Connecticut     3100      5348   1.1        72.48     3.1   56.0    139
Delaware         579      4809   0.9        70.06     6.2   54.6    103
Florida         8277      4815   1.3        70.66    10.7   52.6     11
Georgia         4931      4091   2.0        68.54    13.9   40.6     60
Hawaii           868      4963   1.9        73.60     6.2   61.9      0
Idaho            813      4119   0.6        71.87     5.3   59.5    126
Illinois       11197      5107   0.9        70.14    10.3   52.6    127
Indiana         5313      4458   0.7        70.88     7.1   52.9    122
Iowa            2861      4628   0.5        72.56     2.3   59.0    140
Kansas          2280      4669   0.6        72.58     4.5   59.9    114
Kentucky        3387      3712   1.6        70.10    10.6   38.5     95
Louisiana       3806      3545   2.8        68.76    13.2   42.2     12
Maine           1058      3694   0.7        70.39     2.7   54.7    161
Maryland        4122      5299   0.9        70.22     8.5   52.3    101
Massachusetts   5814      4755   1.1        71.83     3.3   58.5    103
Michigan        9111      4751   0.9        70.63    11.1   52.8    125
Minnesota       3921      4675   0.6        72.96     2.3   57.6    160
Mississippi     2341      3098   2.4        68.09    12.5   41.0     50
Missouri        4767      4254   0.8        70.69     9.3   48.8    108
Montana          746      4347   0.6        70.56     5.0   59.2    155
Nebraska        1544      4508   0.6        72.60     2.9   59.3    139
Nevada           590      5149   0.5        69.03    11.5   65.2    188
New Hampshire    812      4281   0.7        71.23     3.3   57.6    174
New Jersey      7333      5237   1.1        70.93     5.2   52.5    115
New Mexico      1144      3601   2.2        70.32     9.7   55.2    120
New York       18076      4903   1.4        70.55    10.9   52.7     82
North Carolina  5441      3875   1.8        69.21    11.1   38.5     80
North Dakota     637      5087   0.8        72.78     1.4   50.3    186
Ohio           10735      4561   0.8        70.82     7.4   53.2    124
Oklahoma        2715      3983   1.1        71.42     6.4   51.6     82
Oregon          2284      4660   0.6        72.13     4.2   60.0     44
Pennsylvania   11860      4449   1.0        70.43     6.1   50.2    126
Rhode Island     931      4558   1.3        71.90     2.4   46.4    127
South Carolina  2816      3635   2.3        67.96    11.6   37.8     65
South Dakota     681      4167   0.5        72.08     1.7   53.3    172
Tennessee       4173      3821   1.7        70.11    11.0   41.8     70
Texas          12237      4188   2.2        70.90    12.2   47.4     35
Utah            1203      4022   0.6        72.90     4.5   67.3    137
Vermont          472      3907   0.6        71.64     5.5   57.1    168
Virginia        4981      4701   1.4        70.08     9.5   47.8     85
Washington      3559      4864   0.6        71.72     4.3   63.5     32
West Virginia   1799      3617   1.4        69.48     6.7   41.6    100
Wisconsin       4589      4468   0.7        72.48     3.0   54.5    149
Wyoming          376      4566   0.6        70.29     6.9   62.9    173
               Area
Alabama         50708
Alaska         566432
Arizona        113417
Arkansas        51945
California     156361
Colorado       103766
Connecticut      4862
Delaware         1982
Florida         54090
Georgia         58073
Hawaii           6425
Idaho           82677
Illinois        55748
Indiana         36097
Iowa            55941
Kansas          81787
Kentucky        39650
Louisiana       44930
Maine           30920
Maryland         9891
Massachusetts    7826
Michigan        56817
Minnesota       79289
Mississippi     47296
Missouri        68995
Montana        145587
Nebraska        76483
Nevada         109889
New Hampshire    9027
New Jersey       7521
New Mexico     121412
New York        47831
North Carolina  48798
North Dakota    69273
Ohio            40975
Oklahoma        68782
Oregon          96184
Pennsylvania    44966
Rhode Island     1049
South Carolina  30225
South Dakota    75955
Tennessee       41328
Texas          262134
Utah            82096
Vermont          9267
Virginia        39780
Washington      66570
West Virginia   24070
Wisconsin       54464
Wyoming         97203

In [2]:
USPersonalExpenditure

                    1940   1945   1950  1955 1960
Food and Tobacco    22.200 44.500 59.60 73.2 86.80
Household Operation 10.500 15.500 29.00 36.5 46.20
Medical and Health   3.530  5.760  9.71 14.0 21.10
Personal Care        1.040  1.980  2.45  3.4  5.40
Private Education    0.341  0.974  1.80  2.6  3.64

In [3]:
women

   height weight
1  58     115
2  59     117
3  60     120
4  61     123
5  62     126
6  63     129
7  64     132
8  65     135
9  66     139
10 67     142
11 68     146
12 69     150
13 70     154
14 71     159
15 72     164

In [6]:
#to find datasets = type "data()

ERROR: Error in eval(expr, envir, enclos): object 'datasets' not found

In [7]:
states <- state.x77

In [9]:
#first 6 rows
head(states)

           Population Income Illiteracy Life Exp Murder HS Grad Frost Area
Alabama     3615      3624   2.1        69.05    15.1   41.3     20    50708
Alaska       365      6315   1.5        69.31    11.3   66.7    152   566432
Arizona     2212      4530   1.8        70.55     7.8   58.1     15   113417
Arkansas    2110      3378   1.9        70.66    10.1   39.9     65    51945
California 21198      5114   1.1        71.71    10.3   62.6     20   156361
Colorado    2541      4884   0.7        72.06     6.8   63.9    166   103766

In [10]:
#last 6 rows
tail(states)

              Population Income Illiteracy Life Exp Murder HS Grad Frost Area
Vermont        472       3907   0.6        71.64    5.5    57.1    168    9267
Virginia      4981       4701   1.4        70.08    9.5    47.8     85   39780
Washington    3559       4864   0.6        71.72    4.3    63.5     32   66570
West Virginia 1799       3617   1.4        69.48    6.7    41.6    100   24070
Wisconsin     4589       4468   0.7        72.48    3.0    54.5    149   54464
Wyoming        376       4566   0.6        70.29    6.9    62.9    173   97203

In [11]:
#pull a different number of subets
tail(states, 10)

              Population Income Illiteracy Life Exp Murder HS Grad Frost Area
South Dakota    681      4167   0.5        72.08     1.7   53.3    172    75955
Tennessee      4173      3821   1.7        70.11    11.0   41.8     70    41328
Texas         12237      4188   2.2        70.90    12.2   47.4     35   262134
Utah           1203      4022   0.6        72.90     4.5   67.3    137    82096
Vermont         472      3907   0.6        71.64     5.5   57.1    168     9267
Virginia       4981      4701   1.4        70.08     9.5   47.8     85    39780
Washington     3559      4864   0.6        71.72     4.3   63.5     32    66570
West Virginia  1799      3617   1.4        69.48     6.7   41.6    100    24070
Wisconsin      4589      4468   0.7        72.48     3.0   54.5    149    54464
Wyoming         376      4566   0.6        70.29     6.9   62.9    173    97203

In [12]:
#dataframe structure = give you identity of dataframe
str(states)

 num [1:50, 1:8] 3615 365 2212 2110 21198 ...
 - attr(*, "dimnames")=List of 2
  ..$ : chr [1:50] "Alabama" "Alaska" "Arizona" "Arkansas" ...
  ..$ : chr [1:8] "Population" "Income" "Illiteracy" "Life Exp" ...

In [13]:
#summary = give you brief description of each column
summary(states)

   Population        Income       Illiteracy       Life Exp
 Min.   :  365   Min.   :3098   Min.   :0.500   Min.   :67.96
 1st Qu.: 1080   1st Qu.:3993   1st Qu.:0.625   1st Qu.:70.12
 Median : 2838   Median :4519   Median :0.950   Median :70.67
 Mean   : 4246   Mean   :4436   Mean   :1.170   Mean   :70.88
 3rd Qu.: 4968   3rd Qu.:4814   3rd Qu.:1.575   3rd Qu.:71.89
 Max.   :21198   Max.   :6315   Max.   :2.800   Max.   :73.60
     Murder          HS Grad          Frost             Area
 Min.   : 1.400   Min.   :37.80   Min.   :  0.00   Min.   :  1049
 1st Qu.: 4.350   1st Qu.:48.05   1st Qu.: 66.25   1st Qu.: 36985
 Median : 6.850   Median :53.25   Median :114.50   Median : 54277
 Mean   : 7.378   Mean   :53.11   Mean   :104.46   Mean   : 70736
 3rd Qu.:10.675   3rd Qu.:59.15   3rd Qu.:139.75   3rd Qu.: 81163
 Max.   :15.100   Max.   :67.30   Max.   :188.00   Max.   :566432

In [14]:
#data.frame = organize a data frame from scratch
days <- c('Mon','Tue','Wed','Thu','Fri')
temp <- c(76.1, 82.3, 85.4, 78.9, 76.2)
rain <- c(TRUE, FALSE, FALSE, TRUE, TRUE)

In [15]:
days

[1] "Mon" "Tue" "Wed" "Thu" "Fri"

In [16]:
df<-data.frame(days, temp, rain)

In [17]:
df

  days temp rain
1 Mon  76.1  TRUE
2 Tue  82.3 FALSE
3 Wed  85.4 FALSE
4 Thu  78.9  TRUE
5 Fri  76.2  TRUE

In [18]:
str(df)

'data.frame':	5 obs. of  3 variables:
 $ days: Factor w/ 5 levels "Fri","Mon","Thu",..: 2 4 5 3 1
 $ temp: num  76.1 82.3 85.4 78.9 76.2
 $ rain: logi  TRUE FALSE FALSE TRUE TRUE

In [19]:
nrow(df)

[1] 5

In [20]:
ncol(df)

[1] 3

In [21]:
colnames(df)

[1] "days" "temp" "rain"

In [22]:
rownames(df)

[1] "1" "2" "3" "4" "5"

In [24]:
#indexing and selection follow the df[row,column]
#first df
df[1,]

  days temp rain
1 Mon  76.1 TRUE

In [25]:
df[,1]

[1] Mon Tue Wed Thu Fri
Levels: Fri Mon Thu Tue Wed

In [26]:
df[5,]

  days temp rain
5 Fri  76.2 TRUE

In [28]:
df[,'days']

[1] Mon Tue Wed Thu Fri
Levels: Fri Mon Thu Tue Wed

In [29]:
#first 5 rows for days and temp
df[1:5,c('days', 'temp')]

  days temp
1 Mon  76.1
2 Tue  82.3
3 Wed  85.4
4 Thu  78.9
5 Fri  76.2

In [30]:
#use "$" will refer to dataframe's column name
df$rain

[1]  TRUE FALSE FALSE  TRUE  TRUE

In [31]:
df$days

[1] Mon Tue Wed Thu Fri
Levels: Fri Mon Thu Tue Wed

In [32]:
#note use double brackets bc want to reference specific cell
vec<-df[[5,2]]

In [33]:
vec

[1] 76.2

In [34]:
newdf<-df[1:3,1:2]
newdf

  days temp
1 Mon  76.1
2 Tue  82.3
3 Wed  85.4

In [35]:
#change the values of a cell note to use 2 brackets
df[[2,'rain']] <- FALSE

In [36]:
df

  days temp rain
1 Mon  76.1  TRUE
2 Tue  82.3 FALSE
3 Wed  85.4 FALSE
4 Thu  78.9  TRUE
5 Fri  76.2  TRUE

In [37]:
#create a new column
df$celcus <-(df$temp-32)*5/9
df

  days temp rain  celcus
1 Mon  76.1  TRUE 24.50000
2 Tue  82.3 FALSE 27.94444
3 Wed  85.4 FALSE 29.66667
4 Thu  78.9  TRUE 26.05556
5 Fri  76.2  TRUE 24.55556

In [40]:
df['over.80']<-df['temp']>80
df

  days temp rain  celcus   over.80
1 Mon  76.1  TRUE 24.50000 FALSE
2 Tue  82.3 FALSE 27.94444  TRUE
3 Wed  85.4 FALSE 29.66667  TRUE
4 Thu  78.9  TRUE 26.05556 FALSE
5 Fri  76.2  TRUE 24.55556 FALSE

In [41]:
#subset() will help grab a subset of data based on a condition
subset(df, subset=rain==TRUE)

  days temp rain celcus   over.80
1 Mon  76.1 TRUE 24.50000 FALSE
4 Thu  78.9 TRUE 26.05556 FALSE
5 Fri  76.2 TRUE 24.55556 FALSE

In [42]:
subset(df, temp>80)

  days temp rain  celcus   over.80
2 Tue  82.3 FALSE 27.94444 TRUE
3 Wed  85.4 FALSE 29.66667 TRUE

In [43]:
#use multiple conditionl statements using "&" (meaning 'and') or "|" (meaning 'or')
subset(df, days!="Wed" & temp<80)

  days temp rain celcus   over.80
1 Mon  76.1 TRUE 24.50000 FALSE
4 Thu  78.9 TRUE 26.05556 FALSE
5 Fri  76.2 TRUE 24.55556 FALSE

In [47]:
#use bracket notation to do the same things as subset donforget!!![rows,columns]
df[(df$days !="Wed" & df$temp<80),]

  days temp rain celcus   over.80
1 Mon  76.1 TRUE 24.50000 FALSE
4 Thu  78.9 TRUE 26.05556 FALSE
5 Fri  76.2 TRUE 24.55556 FALSE

In [52]:
mean(df$temp[(df$rain==TRUE & df$over.80==FALSE)])

[1] 77.06667

df[(df$days !="Wed" | df$temp<80),]

In [53]:
#order() 
sorted.temp <-order(df$temp)

In [54]:
sorted.temp

[1] 1 5 4 2 3

In [55]:
df[sorted.temp,]

  days temp rain  celcus   over.80
1 Mon  76.1  TRUE 24.50000 FALSE
5 Fri  76.2  TRUE 24.55556 FALSE
4 Thu  78.9  TRUE 26.05556 FALSE
2 Tue  82.3 FALSE 27.94444  TRUE
3 Wed  85.4 FALSE 29.66667  TRUE

In [56]:
#descending temperatures, otehrwise will always be in ascending order
desc.temp<-order(-df['temp'])

In [57]:
desc.temp

[1] 3 2 4 5 1

In [58]:
df[desc.temp,]

  days temp rain  celcus   over.80
3 Wed  85.4 FALSE 29.66667  TRUE
2 Tue  82.3 FALSE 27.94444  TRUE
4 Thu  78.9  TRUE 26.05556 FALSE
5 Fri  76.2  TRUE 24.55556 FALSE
1 Mon  76.1  TRUE 24.50000 FALSE